package com.d.ivan.universalchronometer;

public class QUESTIONS {

    /*Здравствуйте!
    * Что сделано:
    *  1. Добавлено меню на активити "Добавить новый таймер", дублирующее кнопки "Добавить интервал" и "Удалить всё".
    *  2. Добавлено удаление конкретного элемента Свайпом влево для RecyclerView на активити "Добавить новый таймер".
    *  3. Основательно доработан список интервалов(RecyclerView) на MainActivitн:
    *   - добавлена кнопка запуска произвольного интервала;
    *   - выбранный интервал подсвечивается. Даже при прокрутке (на это ушло много времени, пока разобрался кто когда очищается и заполняется в RecyclerView);
    *   - перемещение по интервалам с помощью кнопок Next и Previous отображается на списке интервалов.
    *  4. Добавлен обработчик кнопки "Отмена" активности "Добавить новый таймер". Теперь появляется предупреждение.
    *
    *
    * Исправлено:
    * 
    *  Вопросы:
	*
    *
    *  НЕ Сделано:
    *  1. Нет обработчика кнопок бокового меню на основной активности.
    *  2.
    *
    *
    *  Планы:
    *  1. Перейти на GitHub
    *  2. Перевести всё на фрагменты.
    *  3. Сделать Активность с перечнем всех таймеров, для добавления, удаления и редактирования.
    *  4. Упорядочить проект (раскидать всё по папкам).
    *  5. Улучшить дизайн.
    *
    *
    *  С уважением, Иван.*/
}
